---
kind: property
id: P:Autodesk.Revit.DB.Visual.SchemaCommon.VersionGUID
source: html/2ada87a7-8223-365b-1d20-6f53a40d6cf2.htm
---
# Autodesk.Revit.DB.Visual.SchemaCommon.VersionGUID Property

The property labeled "VersionGUID" common to all visual Asset types.

## Syntax (C#)
```csharp
public static string VersionGUID { get; }
```

## Remarks
This property is of type "AssetPropertyString" and will contain a uuid.